snlkuharlocal/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>(Общ) Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>(Общ) Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
    <comment>Новый НДС</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
    <comment>Новый НДС</comment>
  </enumValues>
  <enumValues>
    <name>НДС22</name>
    <comment>(Общ) Ставка НДС 22%</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтавкиНДС/ManagerModule.bsl
Функция СтавкаНДСПоУмолчанию(Дата) Экспорт
	Результат = Перечисления.СтавкиНДС.НДС18;
	
	Если Дата >= '20260101'  Тогда           
		Результат = Перечисления.СтавкиНДС.НДС22;	
	ИначеЕсли Дата >= '20190101'  Тогда           
		Результат = Перечисления.СтавкиНДС.НДС20;				
	КонецЕсли;	
	
    Возврат Результат;
КонецФункции //СтавкаНДСПоУмолчанию(Дата) Экспорт
